[{"id":"1623576964939","title":"User-Centered Design: A How-To Guide","content":"User-centered design (UCD) is an approach to design that puts users’ needs front and center and follows an iterative design process that focuses on the user’s needs every step of the way. UCD is used frequently in the product design world as both designers and business executives are reaping the benefits of incorporating their users’ needs into design decisions from the very first ideations to the final delivery. \n\nThe goal of user-centered design is to learn about the user and let their needs, values, and expectations guide the design process from start to finish. How do designers achieve this goal? Well, there are a few key steps and guidelines to follow when conducting quality user-centered design. This article explains what those steps are, how to execute them, tools you may need, and important factors to consider throughout the process. \n\nThis is just a quick list of perks the user-centered design process can offer. Recognizing the value UCD brings to product creation and how it can benefit your company can help focus your design team and keep stakeholders or other team members invested and on the same page.\n\nIt’s also important to understand that user-centered design and design thinking are not synonymous!","post_image":"assets/post_image-1623576964899.jpeg","added_date":"13 Jun 2021"},{"id":"1623576668428","title":"The Importance of Mentorship for Aspiring UX Designers","content":"Whether you’re actively building a career in UX design or you’re just starting to think about it, there’s one aspect of your professional development that you don’t want to overlook: mentorship. \n\nAs you’re considering which UX bootcamp to dive into, it’s easy to miss exactly what type of mentorship and support any given training program actually offers. It’s also incredibly easy to get overwhelmed and distracted with the many important things on your career-change checklist. \n\nSo why exactly would you even need a UX design mentor? What does a mentor do? And which UX training programs offer the best kind of mentorship and support? In this guide, we’ll answer all of these questions and more.\n\nOn the whole, a UX design mentor is a seasoned professional who brings all of their experience to the table. They share industry insights and provide guidance, feedback, and support as you establish yourself in the field. \n\nHow your mentor-mentee relationship looks, which platforms you use to connect, which topics you discuss, and what kind of feedback you receive will depend largely on your needs and goals, and your mentor’s specialized knowledge. \n\nIt can also depend on the expectations or parameters of the mentorship itself. However you came in contact with them, it’s a great idea to have a formal conversation early on about your needs and goals and what your mentor can offer in terms of time, feedback, and more. ","post_image":"assets/post_image-1623576668389.jpeg","added_date":"13 Jun 2021"},{"id":"1623576207711","title":"What Are Dark Patterns in UX Design?","content":"A dark pattern is a deceptive user experience that takes advantage of the way people habitually use websites and apps in order to get users to do something they didn’t intend to. \n\nThe term “dark patterns” was coined in 2010 by Harry Brignull, a user experience specialist, when he also started a website dedicated to naming different dark patterns and calling out companies that use them. He’s been busy ever since. Brignull’s reasoning for wanting to spotlight dark patterns is simple. As he explains:\n\n“When you use websites and apps, you don’t read every word on every page—you skim read and make assumptions. If a company wants to trick you into doing something, they can take advantage of this by making a page look like it is saying one thing when it is in fact saying another. You can defend yourself by learning about dark patterns…”\n\nIn this guide, we’ll explore why companies use dark patterns, describe the 12 different kinds of dark patterns identified by Brignull, and explain what to do instead of using these dark patterns.","post_image":"assets/post_image-1623576207701.jpeg","added_date":"13 Jun 2021"},{"id":"1623565657836","title":"Dealing with MERN for the first time","content":"You need to have a basic understanding of all the four technologies that make up the MERN stack. You should also have npm (Node Package Manager) installed. This is NOT a tutorial on MongoDB, Express, React or NodeJS. First of all, create a client folder inside the root folder. The client-side code will reside inside this folder. Create a components folder and a css folder inside the client folder. Now move the index.html file from public folder to client folder and change the extension of index.html from html to ejs. ‘ejs’ is a template engine that lets you generate html markup with plain JavaScript. We will talk more about it when we will configure the server. We will now create the server and configure it. Create a new folder inside your root directory and call it server. This ensures absolute segregation between client-side and server-side code. Inside the server folder, create a server.js file. Copy and paste the following code inside the server.js.","post_image":"assets/post_image-1623565657829.jpeg","added_date":"13 June 2021"},{"id":"1623564180119","title":"My first Server Side App","content":"This is a simple tool that will generate a basic express project with one simple command, similar to create-react-app. It will save us a little bit of time from having to set everything up from scratch. We can begin by running the express command in the Server directory. This will give us a default express app, but we will not use the default configuration we will have to modify it. First let's delete the routes folder, the views folder and the public folder. We will not need them. You should have only 3 files left. The www file in the bin directory, the app.js file and the package.json file. If you accidentally deleted any of these files, simply generate another express project. ","post_image":"assets/post-image-1581461442199.jpg","added_date":"12 June 2021"},{"id":"1581377760891","title":"My first job as a developer","content":"In college, I met a friend at a computer club who was showing a really cool application where you can swipe between different types of clothing!\nBeing very intrigued, I asked my friend if there is any way I can help out and join the team! After some thinking, he told me to finish an assignment, and then they will consider me. Over the weekend, I finished the assignment and was right away told I can join the team, though I would be working for free. That was completely fine for me! ","post_image":"assets/post-image-1581377760883.jpg","added_date":"03 May 2021"},{"id":"1581376324100","title":"I LOVE JavaScript","content":"I have been using JavaScript since the beginning of my coding career!\nI used it to build simple websites and I used it to build large scale applications!  \nNow I use it to teach others, as well as create large applications. The possibilities of this language are endless, and the use cases keep increasing every single day! ","post_image":"assets/post-image-1581376324096.png","added_date":"28 Sep 2020"},{"id":"1581375207401","title":"Why learning coding is important?","content":"Nowadays with everything being electronic, everything needs to be programmed! \n\nFrom computers, to cars, machines, or anything else it most likely requires programming!\n\nSo as a result, demand for coders keeps increasing year by year, due to all these technological advances!","post_image":"assets/post-image-1581375207393.jpg","added_date":"15 Mar 2020"}]